tap "jandedobbeleer/oh-my-posh"
tap "sst/tap"
brew "bat"
brew "bat-extras"
brew "btop"
brew "carapace"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "jq"
brew "just"
brew "lazygit"
brew "neovim"
brew "node"
brew "ouch"
brew "rich-cli"
brew "ripgrep"
brew "sesh"
brew "starship"
brew "television"
brew "tmux"
brew "tmuxinator"
brew "yazi"
brew "yq"
brew "zoxide"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "sst/tap/opencode"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "anseki.vscode-color"
vscode "astro-build.astro-vscode"
vscode "avetis.tokyo-night"
vscode "bbenoist.nix"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jnoortheen.nix-ide"
vscode "johnpapa.vscode-peacock"
vscode "julialang.language-julia"
vscode "kamikillerto.vscode-colorize"
vscode "keifererikson.nightfox"
vscode "kevinrose.vsc-python-indent"
vscode "letrieu.expand-region"
vscode "liviuschera.noctis"
vscode "lukasz-wronski.ftp-sync"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quarto.quarto"
vscode "raunofreiberg.vesper"
vscode "redhat.fabric8-analytics"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "sdras.night-owl"
vscode "shardulm94.trailing-spaces"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "trond-snekvik.simple-rst"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "valentjn.vscode-ltex"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yatki.vscode-surround"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
